In [913]:
pwd

'/Users/mailysjaffret/Desktop/IRONHACK/vanguard_ab_test_week5_project/Notebooks/Ma√Ølys'

In [914]:
import numpy as np
import pandas as pd

df1 = pd.read_csv('../../data/raw/df_final_demo.txt')
df1.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [915]:
df1.shape

(70609, 9)

In [916]:
df1.rename(columns= {'clnt_tenure_yr': 'tenure_year', 'clnt_tenure_mnth': 'tenure_month', 'clnt_age': 'age',
                     'gendr': 'gender', 'num_accts': 'number_of_accounts', 'bal': 'balance'}, inplace=True)

In [917]:
df1.head()

,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [918]:
df1['gender'].nunique

<bound method IndexOpsMixin.nunique of 0        U
1        U
2        U
3        M
4        F
        ..
70604    U
70605    M
70606    F
70607    M
70608    F
Name: gender, Length: 70609, dtype: object>

In [919]:
df1.gender.unique()

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [920]:
df1['gender'].value_counts()

gender
U    24122
M    23724
F    22746
X        3
Name: count, dtype: int64

In [921]:
df1.gender.unique()

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [922]:
df1['gender'] = df1['gender'].replace('X', 'U')

In [923]:
df1['gender'].value_counts()

gender
U    24125
M    23724
F    22746
Name: count, dtype: int64

In [924]:
df1.gender.unique()

array(['U', 'M', 'F', nan], dtype=object)

In [925]:
df1['gender'] = df1['gender'].fillna('U')

In [926]:
df1.gender.isna().sum()

0

In [927]:
df1.gender.unique()

array(['U', 'M', 'F'], dtype=object)

In [928]:
total_U = df1['gender'].value_counts()['U']
half_U = total_U // 2

indices_U = df1[df1['gender'] == 'U'].index

df1.loc[indices_U[:half_U], 'gender'] = 'M'
df1.loc[indices_U[half_U:], 'gender'] = 'F'

In [929]:
df1['gender'].describe()

count     70609
unique        2
top           M
freq      35793
Name: gender, dtype: object

In [930]:
df1['gender'].value_counts()

gender
M    35793
F    34816
Name: count, dtype: int64

In [931]:
df1.dtypes

client_id               int64
tenure_year           float64
tenure_month          float64
age                   float64
gender                 object
number_of_accounts    float64
balance               float64
calls_6_mnth          float64
logons_6_mnth         float64
dtype: object

In [932]:
df1.isnull().sum()

client_id              0
tenure_year           14
tenure_month          14
age                   15
gender                 0
number_of_accounts    14
balance               14
calls_6_mnth          14
logons_6_mnth         14
dtype: int64

In [933]:
df2 = pd.read_csv('../../data/raw/df_final_experiment_clients.txt')
df2.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [934]:
df2.dtypes

client_id     int64
Variation    object
dtype: object

In [935]:
df2.shape

(70609, 2)

In [936]:
df2.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [987]:
df2['Variation'] = df2['Variation'].fillna('no participation')
df2.isnull().sum()

client_id    0
Variation    0
dtype: int64

In [ ]:
#df2 = df2.dropna(axis=0)
#df2.shape

In [1049]:
df_client_info = pd.merge(df1, df2, on='client_id')
df_client_info.head()

,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth,Variation
0,836976,6.0,73.0,60.5,M,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,M,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,M,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control

In [991]:
df_client_info.isnull().sum()

client_id              0
tenure_year           14
tenure_month          14
age                   15
gender                 0
number_of_accounts    14
balance               14
calls_6_mnth          14
logons_6_mnth         14
Variation              0
dtype: int64

In [995]:
df_client_info.shape

(70609, 10)

In [997]:
df_client_info.dropna()

,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth,Variation
0,836976,6.0,73.0,60.5,M,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,M,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,M,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control
...,...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,F,3.0,1411062.68,5.0,5.0,no participation
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0,no participation
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0,no participation
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0,no participation
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,no participation

In [1043]:
df_client_info.to_csv('../../data/clean/df_client_info.csv')

In [999]:
df3 = pd.read_csv('../../data/raw/df_final_web_data_pt_1.txt')
df3.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [1001]:
df3.shape

(343141, 5)

In [1003]:
df3.duplicated().sum()

2095

In [1005]:
df3.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [1007]:
df3 = df3.drop_duplicates()
df3.shape

(341046, 5)

In [1009]:
df3.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [1011]:
df3['date_time'] = pd.to_datetime(df3['date_time'])
df3.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

In [1013]:
df4 = pd.read_csv('../../data/raw/df_final_web_data_pt_2.txt')
df4.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [1015]:
df4.shape

(412264, 5)

In [1017]:
df4.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [1019]:
df4.duplicated().sum()

8669

In [1021]:
df4 = df4.drop_duplicates()

In [1023]:
df4.shape

(403595, 5)

In [1025]:
df4.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [1027]:
df4['date_time'] = pd.to_datetime(df4['date_time'])

In [1029]:
df4.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

In [1031]:
df4.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [1033]:
df5 = pd.concat([df3, df4], axis=0)

In [1035]:
df5.shape

(744641, 5)